<a href="https://colab.research.google.com/github/indiameicorengold/sql-lab/blob/main/Copy_of_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL Lab
**Make sure you save a copy of this lab and `people.db` on your own drive before starting the lab!**

- For the lab, you can go to "File" -> "Save a copy in Drive"
- For the database, you need to download `people.db` and upload it to your own drive


For this lab, we are going to practice writing basic SQL queries. SQLite in Python provides a nice system for us to write SQL queries. You can read more about the difference between SQLite and SQL [here](https://www.javatpoint.com/sql-vs-sqlite)! In the future (for your final projects), also feel free to look into alternatives to SQLite for writing SQL queries and creating databases such as [these](https://stackshare.io/sqlite/alternatives).

At many points of this lab, we ask you to use SQL features that you haven't seen before. You can find relevant documentation on [this site](https://www.w3schools.com/sql/default.asp).

## **I. Working with databases in Python**

1. Run this code to open a new database, called `sql_lab.db`

In [ ]:
import sqlite3

conn = sqlite3.connect('sql_lab.db') # automatically creates new file for 
c = conn.cursor()
# When using SQLite, include the following line to ensure foreign key commands are recognized
c.execute('PRAGMA foreign_keys = ON')

2. Whenever you want to execute a SQL command that modifes the .db file (for example, `INSERT`, `UPDATE`, `CREATE TABLE`), you would want to commit those changes to the file. So, you can use the following syntax:

In [ ]:
# this is the general syntax for commands that span multiple lines
command1 = '''
CREATE TABLE company
(id INT PRIMARY KEY NOT NULL,
name TEXT NOT NULL);
'''

# Use the execute function to execute the command
c.execute(command1)

# And then commit the changes to the file
conn.commit()

3. Whenever you want to query but not modify the file, you use a `SELECT` statement:

In [ ]:
# this is the general syntax for in-line commands
command2 = "SELECT id, name FROM COMPANY;"

c.execute(command2)

Once you have executed the query, you retreive the results by calling some variation of the fetch command (e.g., `fetchall`, `fetchmany`, `fetchone`):

In [ ]:
c.fetchall() # returns an empty list, since the table empty

[]

You can read more about working with SQLite in Python [here](https://www.tutorialspoint.com/sqlite/sqlite_python.htm).

## **II. Writing Queries to a Database**

For this part of the lab, we have provided a database named `people.db` with the name, age, ID, and occupation and social connections of some (fake) Brown students and alumni. Here is the schema:

*   `people_main(ID INTEGER, name TEXT, occupation TEXT, age INTEGER)`
*   `people_likes(ID1 INTEGER, ID2 INTEGER)`
*   `people_friends(ID1 INTEGER, ID2 INTEGER)`


In the `people_main` table, `ID` is a unique identifier for a particular student or alumnus. Name, occupation and age correspond to the person's first name, occupation and age.

In the `people_likes` table, each `(ID1, ID2)` pair indicates that the person with `ID1` is friends with the person with `ID2` (and vice versa). The friendship is mutual, and, if `(ID1, ID2)` is in the table, it is guaranteed that `(ID2, ID1)` exists in the table.

In the people_friends table, each `(ID1, ID2)` pair indicates that the student or alumnus with `ID1` likes the person with `ID2`. The `(ID1, ID2)` pair in the table does not guarantee that the `(ID2, ID1)` pair also exists in the table.

Your job is to write SQL queries for the data being requested for each part below.

**Note**: You will be continuing this task in the assignment with the same database, so hopefully getting familiar with the database here will help you with the assignment!

Run the cell below to load the database:

In [ ]:
import sqlite3
from google.colab import drive
drive.mount('/content/gdrive', force_remount=True)

# this path points to where your people.db file is located on your Google Drive
# you need to modify the path if your file is at a different location
path = "/content/gdrive/My Drive/csci1951a/Copy of people.db" 
conn = sqlite3.connect(path)
c = conn.cursor()

Mounted at /content/gdrive

1. Write a SQL statement that returns the name of people, ordered by name (A-Z). Replace the question mark with the correct terms.

In [ ]:
command1 = '''
SELECT
  name
FROM
  people_main
ORDER BY name ASC;
'''

# Do not modify below this line
c.execute(command1)
count = 0
for row in c:
  count += 1
  print("NAME = ", row[0])
assert count == 17

NAME =  Amy
NAME =  Andy
NAME =  Anne
NAME =  Bill
NAME =  Bob
NAME =  Ellie
NAME =  Esteban
NAME =  Jens
NAME =  Kate
NAME =  Kevin
NAME =  Luis
NAME =  Michael
NAME =  Rachel
NAME =  Robert
NAME =  Ryan
NAME =  Thomas
NAME =  Tony

2. Write a SQL statement that returns the name and age of people who are engineers or doctors. Results should be ordered by name (A-Z).

In [ ]:
command2 = '''
SELECT
  name,
  age
FROM
  people_main
WHERE
  occupation = 'engineer' OR occupation = 'doctor'
ORDER BY name;
'''

# Do not modify below this line
c.execute(command2)
count = 0
for row in c:
   print("NAME = ", row[0])
   print("AGE = ", row[1], "\n")
   count += 1
assert count == 8

NAME =  Amy
AGE =  30

NAME =  Andy
AGE =  57

NAME =  Anne
AGE =  82

NAME =  Bob
AGE =  59

NAME =  Luis
AGE =  99

NAME =  Michael
AGE =  12

NAME =  Thomas
AGE =  16

NAME =  Tony
AGE =  29

3. Write a SQL statement that returns the name of people that are liked by at least one other person. Results should be ordered by name (A-Z).
Careful! Some people are liked multiple times, but their name should only appear once. Take a look at the `DISTINCT` and `IN` operators.

In [ ]:
command3 = '''
SELECT
  DISTINCT name
FROM
  people_main
WHERE
  ID IN (SELECT ID2 FROM people_likes)
ORDER BY name;
'''

# Do not modify below this line
c.execute(command3)
count = 0
for row in c:
   print("NAME = ", row[0])
   count += 1
assert count == 8

NAME =  Anne
NAME =  Bob
NAME =  Esteban
NAME =  Kevin
NAME =  Michael
NAME =  Rachel
NAME =  Robert
NAME =  Thomas

4. Write a SQL statement that returns the name of people who arenâ€™t liked by anyone else. Results should be ordered by name (A-Z).
Hint: This should be very similar to the previous question!

In [ ]:
command4 = '''
SELECT
  name
FROM
  people_main
WHERE
   ID NOT IN (SELECT ID2 FROM people_likes)
ORDER BY name;
'''

# Do not modify below this line
c.execute(command4)
count = 0
for row in c:
   print("NAME = ", row[0])
   count += 1
assert count == 9

NAME =  Amy
NAME =  Andy
NAME =  Bill
NAME =  Ellie
NAME =  Jens
NAME =  Kate
NAME =  Luis
NAME =  Ryan
NAME =  Tony

5. Write a SQL statement that returns each occupation and the number of people with that occupation. Results should be ordered by number of people within that occupation (descending), and then by occupation (A-Z).
Hint: Look at `GROUP BY` and `COUNT`.

In [ ]:
command5 = '''
SELECT
  occupation, COUNT(*) 
FROM
  people_main
GROUP BY occupation
ORDER BY COUNT(*) DESC, occupation ASC;
'''

# Do not modify below this line
c.execute(command5)
count = 0
for row in c:
   print("OCCUPATION = ", row[0])
   print("NUMBER = ", row[1], "\n")
   assert row[1] <= 5
   count += 1
assert count == 4

c.close()

OCCUPATION =  professor
NUMBER =  5

OCCUPATION =  doctor
NUMBER =  4

OCCUPATION =  engineer
NUMBER =  4

OCCUPATION =  student
NUMBER =  4

## **III. Theory**

Read about primary keys [here](https://www.w3schools.com/sql/sql_primarykey.ASP) and foreign keys [here](https://www.w3schools.com/sql/sql_foreignkey.asp).

**Some key takeaways (heh, pun intended)**:

Primary key:
- A primary key of a table serves to identify different records in that  table. It therefore must be not null and unique for each row. It is declared with the `PRIMARY KEY` keyword.
- A table can only have one primary key, and those primary keys can consist of multiple fields (i.e. a combination of things, for example, a name, date of birth, and ZIP code).

Foreign key
- A foreign key on attribute Q in table B is a reference to an attribute P in table A. It is declared with the keywords `FOREIGN KEY REFERENCES table_A(attribute_P)`
- A foreign key, unlike a primary key, can have a `NULL` value, and does not need to be unique.

## **IV. Designing a database**

You want to create a database that keeps track of the information of all the students at Brown, and the courses that they are taking.

You know the following about the students:
- The students may share the same name
- Each student has to have a name
- Each student has a unique Banner ID
- Each student takes at most five courses (thereâ€™s a possibility that the student isn't taking any courses if they are taking a gap semester, for example)

You know the following about the courses:
- Each course has a course code and a course name
- Each course can have different offerings by different professors. For example, `MATH0520` - Linear Algebra - can be taught by Professor Landman, Professor Ivanov, and Professor Li, in the same semester.

You also know your expectations with this database schema:
The University is going to use this database to get
- (1) the list of students that are enrolled in a course,
- (2) a list of courses that a student is enrolled in

<!-- To do this, you create three tables with the following schemas: 

student(banner_id, student_name)
course(course_code, course_name, professor_name)
takes(banner_id, course_id, professor_name) -->

> ### **Check-off:**
- From your knowledge about primary keys and foreign keys, identify all potential primary keys and foreign keys for the schema above.
- Design necessary database schema(s) that would satisfy the requirements above
- Write your schema below in the format `table_name(attribute1, attribute2, etc)` and show to a TA:

In [ ]:
# Your schema here: students(bannerID, name, courses)
# courses(code, name, professors)
# professors(id, name, course, students)
# bannerID, code, and professors.id will all be primary keys. 
# students.courses, courses.professors, professors.course, and professors.students will all require foreign keys.

## **V. Creating and modifying a database**

#### Note: For the rest of this half of the lab, please use the following schema for your tables, regardless of the schemas you came up with above. (Also, please note that the following table is designed only for the purpose of helping you learn in this lab but violates the standards of first normal form. To learn more about first normal form, see [here](https://en.wikipedia.org/wiki/First_normal_form) or take a databases course, like CSCI 1270):
```
students(banner_id, name, course_one, course_one_prof_last_name, course_two, course_two_last, course_three, course_three_last)
courses(course_id, course_name, course_professor_last_name)
```


### 1. `CREATE` statement

You can read more about the `CREATE` statement [here](https://www.w3schools.com/sql/sql_create_table.asp).

> ### **Check-off:**
Using the `CREATE` statement that we learned in class (and the link above), create table(s) in the database that represent the schema described above. Using the information that you already acquired about primary keys and foreign keys, be sure to represent these key constraints (among other attributes like the type or `NOT NULL`) in your table(s)!

In [ ]:
c = conn.cursor()

# Run this code block if you would like to drop your tables
c.execute('PRAGMA foreign_keys = OFF')

c.execute('DROP TABLE IF EXISTS Courses;')
c.execute('DROP TABLE IF EXISTS Students;')

c.execute('PRAGMA foreign_keys = ON')

OperationalError: ignored

In [ ]:
# Create your tables here
# Don't forget to execute and commit!

# create one table
create_courses_table_command = '''
CREATE TABLE IF NOT EXISTS Courses (
	course_id char(8) NOT NULL,
	course_name varchar(255) NOT NULL,
	course_professor_last_name varchar(100) NOT NULL,
	PRIMARY KEY (course_id, course_professor_last_name)
);
'''

conn = sqlite3.connect("university.db")
c = conn.cursor()

# execute
c.execute(create_courses_table_command)


# create second table (read about ON DELETE SET NULL in section 3 below!)
create_student_table_command = '''
CREATE TABLE IF NOT EXISTS Students (
	banner_id int NOT NULL,
	name varchar(255) NOT NULL,
	course_one char(8),
	course_one_last varchar(255),
	course_two char(8),
	course_two_last varchar(255),
	course_three char(8),
	course_three_last varchar(255),
	PRIMARY KEY (banner_id),
	FOREIGN KEY (course_one, course_one_last) REFERENCES Courses(course_id, course_professor_last_name) ON DELETE SET NULL,
	FOREIGN KEY (course_two, course_two_last) REFERENCES Courses(course_id, course_professor_last_name) ON DELETE SET NULL,
	FOREIGN KEY (course_three, course_three_last) REFERENCES Courses(course_id, course_professor_last_name) ON DELETE SET NULL
);
'''

# execute
c.execute(create_student_table_command)

In [ ]:
# check to see that your tables were created
c.execute("""SELECT 
    name
FROM 
    sqlite_master 
WHERE 
    type ='table' AND 
    name NOT LIKE 'sqlite_%';""")
c.fetchall()

### 2. `INSERT` statement

You can read more about the `INSERT` statement [here](https://www.w3schools.com/sql/sql_insert.asp)

Insert the following information to the table(s) that you created:
- A course with the following information: ID: CSCI0180, Name: â€œComputer Science: An Integrated Introductionâ€, Professor: Fisler.
- A course with the following information: ID: MATH0100, Name: â€œIntroductory Calculus, Part IIâ€, and this course is offered by multiple professors: Professor Bae and  Professor Hu.
- Professor Hu is also teaching a course with the following information: ID: MATH0200, Name: â€œIntermediate Calculus (Physics/Engineering)â€
- Two other courses of your choice that do not begin with CSCI or MATH.
- Three students of your choice, each taking 1, 2 and 3 courses, respectively.

> ### **Check-off:**
Insert information according to the instructions above, and call a TA over once you are done. Don't forget to commit the changes! 

**Tip**: When inserting several values into your table, you can also use the syntax:
`c.execute(â€œINSERT INTO table_name VALUES (?, ?, ?);â€, (value1, value2, value3))`

In [ ]:
# Put your insert statements here!
c.execute('''INSERT INTO Courses VALUES (?, ?, ?);''', ('MATH0100', 'Introductory Calculus, Part II', 'Bae'))
?

In [ ]:
# Use this to see what your table holds
c.execute('''SELECT * FROM Courses;''')

for row in c:
  print(row)

c.execute('''SELECT * FROM Students;''')
for row in c:
  print(row)

### 3. `DELETE` statement

You can read more about the `DELETE` statement [here](https://www.w3schools.com/sql/sql_delete.asp)

How unfortunate! Professor Hu just caught a really bad flu and will not be able to teach the courses that they intended to teach this semester.

The Math department thought that it would be okay to not offer MATH0200 with Professor Hu this semester. Delete the course â€œMATH0200â€ taught by Professor Hu.

**Note**: When deleting an entry that is referenced in another table, make sure to go back to where you created the tables and include `ON DELETE SET NULL` after declaring the foreign key when creating the table. For example:

```
# If Students references another table S
chools(school, city) and a school is deleted, 
# we want those school, city fields to be set to NULL for any students who attended that school.
CREATE TABLE Students (
	name varchar(255) NOT NULL,
	school varchar(255),
	city varchar(255),
	PRIMARY KEY (name),
	FOREIGN KEY (school, city) REFERENCES Schools (school, city) ON DELETE SET NULL
)
```
If you want to learn more about deleting a primary key that is referenced to in another table, read [here](https://www.techonthenet.com/sqlite/foreign_keys/foreign_delete.php).

### 4. `UPDATE` statement

You can read more about the `UPDATE` statement [here](https://www.w3schools.com/sql/sql_update.asp)

The math department has decided to restructure its calculus sequence, where MATH0100 will now be called â€œPrinciples of Calculus.â€ Update all of the MATH0100 courses so that their names reflect this change. 

(**Note**: One thing to take note of is that primary keys cannot be updated this way. In order to change a primary key, we suggest removing the original entry and inserting a new one with the new key.)

> ### **Check-off:**
Modify the database using the information above (donâ€™t forget to commit!), and call a TA over once you are done.

In [ ]:
# DELETE
delete_command = '''
DELETE FROM ?
WHERE ? AND ?;
'''

# UPDATE
update_command = '''
UPDATE ?
SET ?
WHERE ?;
'''

# Don't forget to execute and commit!
?
?
?

In [ ]:
c.execute('''SELECT * FROM Courses;''')

for row in c:
  print(row)

c.execute('''SELECT * FROM Students;''')
for row in c:
  print(row)

## VI. More Advanced Queries! 
Using the database you just created, let's practice with some more advanced SQL operations you will encounter in the SQL assignment!

### 1. `HAVING` statement

You can read more about the `HAVING` statement [here](https://www.w3schools.com/sql/sql_having.asp)

The head of the Registrar wants to know which courses are taught by more than one professor.

In [ ]:
having_command = '''
SELECT
  ?
FROM
  ?
GROUP BY course_id
HAVING COUNT(?) > 1;
'''
c.execute(having_command)
for row in c:
   print("Course ID = ", row[0])

### 2. `JOIN` statement

You can read more about the `JOIN` statement [here](https://www.w3schools.com/sql/sql_join.asp)

You have been tasked with finding the names of all students and course names for their `course_one`. 

The results look like: (student1's name, student1 course_one's course name)

Hint: Join your two tables on the primary key(s) of the course table!

In [ ]:
join_command = '''
SELECT
  a.?, b.?
FROM
  ? a
JOIN ? b ON a.? = b.? 
AND a.? = b.?;
'''
c.execute(join_command)

for row in c:
   print("Course ID = ", row[0])
   print("Name = ", row[1], "\n")

### 3. `WITH` statement

You can read more about the `WITH` statement [here](https://www.geeksforgeeks.org/sql-with-clause/)

Of all the courses at Brown taught by more than one professor, you are tasked to find the course which is taught by the most number of professors and what that number is.

In [ ]:
with_command = '''
WITH subquery AS 
  (SELECT course_id, COUNT(course_id) as count
  FROM Courses
  GROUP BY course_id
  HAVING COUNT(course_id) > 1
)

SELECT
  course_id, ?(count)
  FROM subquery
;
'''
c.execute(with_command)
for row in c:
   print("Course ID = ", row[0])
   print("Count = ", row[1], "\n")

### 4. `CASE` statement

You can read more about the `CASE` statement [here](https://www.w3schools.com/sql/sql_case.asp)

You have been tasked to write a query that shows the number of professors at Brown with names that start with A through C, and the number of professors at Brown with names that start with D through Z.

In [ ]:
case_command = '''
SELECT 
  CASE WHEN ? < 'D' THEN 'A-C'
       WHEN ? >= 'D' THEN 'D-Z'
       ELSE NULL END AS professor_name_group,
  COUNT(1) as professors
FROM
  Courses
GROUP BY 1
;
'''
c.execute(case_command)
for row in c:
   print("professor_name_group = ", row[0])
   print("professors = ", row[1], "\n")

### 5. Closing
Close the cursor and the connection when you are done with the lab. Now get yourself checked off ðŸŽ‰

In [ ]:
c.close()
conn.close()

### Credit

Made by Maggie (mwu27) and Nam (ndo3) in Spring 2020. 
Updated by Dharam (dmadnani) in Spring 2021. Updated by Annabel (aroth7) and Alex (ading13) in Spring 2023.